stm32duino/stm32flash/main.c
			/* page_len will hold the actual number of bytes to program
			 * in this page. This should only be different from page_size
			 * when we reach the end of the data to program.
			 */
			page_len	= page_size > left ? left : page_size;
			page_len	= page_len > size - offset ? size - offset : page_len;

			/* Prepare a buffer to hold the data that will be written to
			 * this page. Note that we only allocate a new buffer if the
			 * one that we used previously is too small.
			 */
			if (!page_data || page_len > allocated_page_len) {
				free(page_data);
				page_data = malloc(page_len);
				allocated_page_len = page_len;
			}

			if (!page_data) {
				fprintf(stderr, "Failed to allocate %u bytes.\n", page_len);
				goto close;
			}

			if (parser->read(p_st, page_data, &page_len) != PARSER_ERR_OK)
				goto close;

			if (page_len == 0) {
				if (filename[0] == '-') {
					break;
				} else {
					fprintf(stderr, "Failed to read input file\n");
					goto close;
				}
			}

			/* If this page has already been erased, we can
			 * skip programming if the new data is all 0xff.
			 */
			if (!no_erase && num_pages > page_number) {
				if (buffer_is_0xff_only(page_data, page_len)) {
					addr	+= page_len;
					offset	+= page_len;
					continue;
				}
			}

			uint32_t left_in_page = page_len;
			uint32_t block_offset = 0;

			/* Now program the page's data in the chunk size that was
			 * previously chosen.
			 */
			while (left_in_page > 0) {
				len	= max_wlen > left_in_page ? left_in_page : max_wlen;

again:
				s_err = stm32_write_memory(stm, addr, &page_data[block_offset], len);
				if (s_err != STM32_ERR_OK) {
					fprintf(stderr, "Failed to write memory at address 0x%08x\n", addr);
					goto close;
				}

				if (verify) {
					uint8_t compare[len];
					unsigned int offset, rlen;

					offset = 0;
					while (offset < len) {
						rlen = len - offset;
						rlen = rlen < max_rlen ? rlen : max_rlen;
						s_err = stm32_read_memory(stm, addr + offset, compare + offset, rlen);
						if (s_err != STM32_ERR_OK) {
							fprintf(stderr, "Failed to read memory at address 0x%08x\n", addr + offset);
							goto close;
						}
						offset += rlen;
					}

					for(r = 0; r < len; ++r)
						if (page_data[block_offset + r] != compare[r]) {
							if (failed == retry) {
								fprintf(stderr, "Failed to verify at address 0x%08x, expected 0x%02x and found 0x%02x\n",
								        (uint32_t)(addr + r),
								        page_data[block_offset + r],
								        compare[r]
								);
								goto close;
							}
							++failed;
							goto again;
						}

					failed = 0;
				}

				addr		+= len;
				offset		+= len;
				left_in_page	-= len;
				block_offset	+= len;

				fprintf(diag,
				        "\rWrote %saddress 0x%08x (%.2f%%) ",
				        verify ? "and verified " : "",
				        addr,
				        (100.0f / size) * offset
				);
				fflush(diag);
			}
		}

		fprintf(diag,	"Done.\n");
		ret = 0;
		goto close;
	} else if (action == ACT_CRC) {
		uint32_t crc_val = 0;

		fprintf(diag, "CRC computation\n");

		s_err = stm32_crc_wrapper(stm, start, end - start, &crc_val);
		if (s_err != STM32_ERR_OK) {
			fprintf(stderr, "Failed to read CRC\n");
			goto close;
		}
		fprintf(diag, "CRC(0x%08x-0x%08x) = 0x%08x\n", start, end,
			crc_val);
		ret = 0;
		goto close;
	} else
		ret = 0;

close:
	free(page_data);
	page_data = NULL;

	if (stm && exec_flag && ret == 0) {
		if (execute == 0)
			execute = stm->dev->fl_start;

		fprintf(diag, "\nStarting execution at address 0x%08x... ", execute);
		fflush(diag);
		if (stm32_go(stm, execute) == STM32_ERR_OK) {
			reset_flag = 0;
			fprintf(diag, "done.\n");
		} else
			fprintf(diag, "failed.\n");
	}

	if (stm && reset_flag) {
		fprintf(diag, "\nResetting device... ");
		fflush(diag);
		if (init_bl_exit(stm, port, gpio_seq))
			fprintf(diag, "done.\n");
		else	fprintf(diag, "failed.\n");
	}

	if (p_st  ) parser->close(p_st);
	if (stm   ) stm32_close  (stm);
	if (port)
		port->close(port);

	fprintf(diag, "\n");
	return ret;
}

int parse_options(int argc, char *argv[])
{
	int c;
	char *pLen;

	while ((c = getopt(argc, argv, "a:b:m:r:w:e:vn:g:jkfcChuos:S:F:i:R")) != -1) {
		switch(c) {
			case 'a':
				port_opts.bus_addr = strtoul(optarg, NULL, 0);
				break;

			case 'b':
				port_opts.baudRate = serial_get_baud(strtoul(optarg, NULL, 0));
				if (port_opts.baudRate == SERIAL_BAUD_INVALID) {
					serial_baud_t baudrate;
					fprintf(stderr,	"Invalid baud rate, valid options are:\n");
					for (baudrate = SERIAL_BAUD_1200; baudrate != SERIAL_BAUD_INVALID; ++baudrate)
						fprintf(stderr, " %d\n", serial_get_baud_int(baudrate));
					return 1;
				}
				break;

			case 'm':
				if (strlen(optarg) != 3
					|| serial_get_bits(optarg) == SERIAL_BITS_INVALID
					|| serial_get_parity(optarg) == SERIAL_PARITY_INVALID
					|| serial_get_stopbit(optarg) == SERIAL_STOPBIT_INVALID) {
					fprintf(stderr, "Invalid serial mode\n");
					return 1;
				}
				port_opts.serial_mode = optarg;
				break;

			case 'r':
			case 'w':
				if (action != ACT_NONE) {
					err_multi_action((c == 'r') ? ACT_READ : ACT_WRITE);
					return 1;
				}
				action = (c == 'r') ? ACT_READ : ACT_WRITE;
				filename = optarg;
				if (filename[0] == '-') {
					force_binary = 1;
				}
				break;
			case 'e':
				if (readwrite_len || start_addr) {
					fprintf(stderr, "ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
					return 1;
				}
				npages = strtoul(optarg, NULL, 0);
				if (npages > 0xFF || npages < 0) {
					fprintf(stderr, "ERROR: You need to specify a page count between 0 and 255");
					return 1;
				}
				if (!npages)
					no_erase = 1;
				break;
			case 'u':
				if (action != ACT_NONE) {
					err_multi_action(ACT_WRITE_UNPROTECT);
					return 1;
				}
				action = ACT_WRITE_UNPROTECT;
				break;

			case 'j':
				if (action != ACT_NONE) {
					err_multi_action(ACT_READ_PROTECT);
					return 1;
				}
				action = ACT_READ_PROTECT;
				break;

